Tekla Open API Reference for Tekla Structures 2025
Solid.SolidCreationTypeEnum Enumeration
 The creation type of the solid.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum SolidCreationTypeEnum
Public Enumeration SolidCreationTypeEnum
Members
Member name | Value | Description
RAW | 0 |  The solid is created without any boolean operations.
FITTED | 1 |  The solid is created with fittings.
NORMAL | 2 |  The solid is created including all cutting and fitting operations.
HIGH_ACCURACY | 3 |  The solid is created as normal with an exact profile cross section.
PLANECUTTED | 4 |  The solid is created with fittings and cut planes.
NORMAL_WITHOUT_EDGECHAMFERS | 5 |  The solid is created including all cutting and fitting operations without edge chamfers.
NORMAL_WITHOUT_WELDPREPS | 6 |  The solid is created including all cutting and fitting operations without weld prepping.
See Also
Reference
Tekla.Structures.Model Namespace